blog/app/views/articles/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---
           </li>
          <li><small><%= pluralize(@article.user.articles.count, "article") if @article.user.articles %> </small></li>