blog/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)

INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "This is my first article"], ["description", "This is my first article"], ["user_id", 1], ["created_at", "2018-03-22 23:09:23.988004"], ["updated_at", "2018-03-22 23:09:23.988004"]]
---
  def create
    #render plain: params[:article].inspect
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
---
     def set_article
       @article = Article.find(params[:id])