blog/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "stevengangano@yahoo.com"]]
---
  def create
    user = User.find_by(email: params[:session][:email].downcase)