blog/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"
---
	def index
		@users = User.paginate(page: params[:page], per_page: 5)

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
   def create
     @user = User.new(user_params)
     if @user.save

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
---
	def show
# 		@user = User.find(params[:id])
			@user_articles = @user.articles.paginate(page: params[:page], per_page: 5)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
   def set_user
	 	@user = User.find(params[:id])